## Plan Result (sbox-apim-appgw)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 1 to change, 1 to destroy.</code></pre>

* Create
  * module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
* Update
  * module.app-gw.azurerm_application_gateway.ag[0]
* Replace
  * module.app-gw.azurerm_public_ip.app_gw[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.app-gw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/applicationGateways/cft-apim00-sandbox-agw"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.app-gw.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/applicationGateways/cft-apim00-sandbox-agw"
        name                              = "cft-apim00-sandbox-agw"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
        }
        # (7 unchanged attributes hidden)

      ~ frontend_ip_configuration {
            id                            = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/applicationGateways/cft-apim00-sandbox-agw/frontendIPConfigurations/appGwPublicFrontendIp"
            name                          = "appGwPublicFrontendIp"
          ~ public_ip_address_id          = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/publicIPAddresses/apim-appgw-sandbox-pip" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/applicationGateways/cft-apim00-sandbox-agw/backendAddressPools/cft-api-mgmt-appgw" -> null
          - backend_address_pool_name  = "cft-api-mgmt-appgw" -> null
          - backend_http_settings_id   = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/applicationGateways/cft-apim00-sandbox-agw/backendHttpSettingsCollection/cft-api-mgmt-appgw" -> null
          - backend_http_settings_name = "cft-api-mgmt-appgw" -> null
          - http_listener_id           = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/applicationGateways/cft-apim00-sandbox-agw/httpListeners/cft-api-mgmt-appgw" -> null
          - http_listener_name         = "cft-api-mgmt-appgw" -> null
          - id                         = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/applicationGateways/cft-apim00-sandbox-agw/requestRoutingRules/cft-api-mgmt-appgw" -> null
          - name                       = "cft-api-mgmt-appgw" -> null
          - priority                   = 10 -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "cft-api-mgmt-appgw"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "cft-api-mgmt-appgw"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "cft-api-mgmt-appgw"
          + id                         = (known after apply)
          + name                       = "cft-api-mgmt-appgw"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

        # (14 unchanged blocks hidden)
    }

  # module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-sandbox"
      + name                       = "AppGw"
      + target_resource_id         = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/applicationGateways/cft-apim00-sandbox-agw"

      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

  # module.app-gw.azurerm_public_ip.app_gw[0] must be replaced
-/+ resource "azurerm_public_ip" "app_gw" {
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      ~ id                      = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/publicIPAddresses/apim-appgw-sandbox-pip" -> (known after apply)
      ~ ip_address              = "20.108.143.135" -> (known after apply)
      - ip_tags                 = {} -> null
        name                    = "apim-appgw-sandbox-pip"
        tags                    = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
        }
      - zones                   = [
          - "1",
          - "2",
          - "3",
        ] -> null # forces replacement
        # (7 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 1 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.app-gw.azurerm_application_gateway.ag[0] has changed
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/applicationGateways/cft-apim00-sandbox-agw"
        name                              = "cft-apim00-sandbox-agw"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
        }
        # (7 unchanged attributes hidden)

      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/applicationGateways/cft-apim00-sandbox-agw/backendAddressPools/cft-api-mgmt-appgw" -> null
          - backend_address_pool_name  = "cft-api-mgmt-appgw" -> null
          - backend_http_settings_id   = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/applicationGateways/cft-apim00-sandbox-agw/backendHttpSettingsCollection/cft-api-mgmt-appgw" -> null
          - backend_http_settings_name = "cft-api-mgmt-appgw" -> null
          - http_listener_id           = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/applicationGateways/cft-apim00-sandbox-agw/httpListeners/cft-api-mgmt-appgw" -> null
          - http_listener_name         = "cft-api-mgmt-appgw" -> null
          - id                         = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/applicationGateways/cft-apim00-sandbox-agw/requestRoutingRules/cft-api-mgmt-appgw" -> null
          - name                       = "cft-api-mgmt-appgw" -> null
          - priority                   = 0 -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/applicationGateways/cft-apim00-sandbox-agw/backendAddressPools/cft-api-mgmt-appgw"
          + backend_address_pool_name  = "cft-api-mgmt-appgw"
          + backend_http_settings_id   = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/applicationGateways/cft-apim00-sandbox-agw/backendHttpSettingsCollection/cft-api-mgmt-appgw"
          + backend_http_settings_name = "cft-api-mgmt-appgw"
          + http_listener_id           = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/applicationGateways/cft-apim00-sandbox-agw/httpListeners/cft-api-mgmt-appgw"
          + http_listener_name         = "cft-api-mgmt-appgw"
          + id                         = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/applicationGateways/cft-apim00-sandbox-agw/requestRoutingRules/cft-api-mgmt-appgw"
          + name                       = "cft-api-mgmt-appgw"
          + priority                   = 10
          + rule_type                  = "Basic"
        }

        # (15 unchanged blocks hidden)
    }

  # module.app-gw.azurerm_public_ip.app_gw[0] has changed
  ~ resource "azurerm_public_ip" "app_gw" {
        id                      = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/publicIPAddresses/apim-appgw-sandbox-pip"
        name                    = "apim-appgw-sandbox-pip"
        tags                    = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
        }
      ~ zones                   = [
          + "1",
          + "2",
          + "3",
        ]
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":1375,"Program":"tfcmt","SHA1":"","Target":"sbox-apim-appgw","Vars":{}} -->